bayta1985/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BTN_KEY_Pin GPIO_PIN_0
#define BTN_KEY_GPIO_Port GPIOA
#define SPI1_CS_Pin GPIO_PIN_3
#define SPI1_CS_GPIO_Port GPIOA
#define RES_TFT_Pin GPIO_PIN_12
#define RES_TFT_GPIO_Port GPIOB
#define SPI2_SCK_TFT_SCL_Pin GPIO_PIN_13
#define SPI2_SCK_TFT_SCL_GPIO_Port GPIOB
#define DC_TFT_Pin GPIO_PIN_14
#define DC_TFT_GPIO_Port GPIOB
#define SPI2_MOSI_TFT_SDA_Pin GPIO_PIN_15
#define SPI2_MOSI_TFT_SDA_GPIO_Port GPIOB
#define BLK_TFT_Pin GPIO_PIN_8
#define BLK_TFT_GPIO_Port GPIOA
#define GND_OLED_Pin GPIO_PIN_4
#define GND_OLED_GPIO_Port GPIOB
#define VCC_OLED_Pin GPIO_PIN_5
#define VCC_OLED_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
